Repository: lefterisnik/django-loosecms-rss
Catalog: loosecms_rss/locale/*/LC_MESSAGES/django.po
Languages: el

source: title
el: τίτλος

source: Give the name of the rss manager.
el: Δώστε το όνομα το διαχειριστή των rss.

source: published
el: δημοσίευση

source: Give the name of the rss.
el: Δώστε το όνομα του rss.

source: slug
el: ετικέτα

source: Give the slug of the rss
el: Δώστε την ετικέτα του rss.

source: feed
el: διεύθυνση τροφοδότησης

source: Give the feed url
el: Δώστε την διεύθυνση τροφοδότησης περιεχομένου του rss.

source: timeout
el: διάρκεια προσωρινής μνήμης

source: Give the timeout to reload rss. If the values is 0, each time will begin request to feed url to download rss content(adding delaying).
el: Δώστε το χρόνο σε δευτερόλεπτα μετά τα οποία θα επειχειρείτε ανανέωση του περιεχομένου του rss. Εάν η τιμή είναι 0, τότε κάθε φορά θα επειχειρείτε ανάγνωση από την πηγή.

source: image
el: εικόνα

source: manager
el: διαχειριστής

source: Select the rss manager.
el: Επιλέξτε το διαχειριστή των rss.

source: order
el: σειρά εμφάνισης
